
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · 神行者路由用户手册</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="www.xspeeder.com">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="pages/support.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/xspeeder-software/xspeeder-docs/raw/master/xspeeder-docs.pdf" target="_blank" class="custom-link">PDF文档下载</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="pages/support.html">
            
                <a href="pages/support.html">
            
                    
                    1. 服务支持
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="pages/versions.html">
            
                <a href="pages/versions.html">
            
                    
                    2. 产品发布记录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="pages/quickstart.html">
            
                <a href="pages/quickstart.html">
            
                    
                    3. 快速开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pages/faqs.html">
            
                <a href="pages/faqs.html">
            
                    
                    4. 常见问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="pages/solution/solution.html">
            
                <a href="pages/solution/solution.html">
            
                    
                    5. 解决方案
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="pages/solution/isp_pppoe_proxy.html">
            
                <a href="pages/solution/isp_pppoe_proxy.html">
            
                    
                    5.1 运营商宽带二次认证-PPPOE代拨方案
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="pages/solution/university_pppoe_proxy.html">
            
                <a href="pages/solution/university_pppoe_proxy.html">
            
                    
                    5.2 高校多运营商联合运营-PPPOE代拨方案
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="pages/opt/opt.html">
            
                <a href="pages/opt/opt.html">
            
                    
                    6. 操作手册
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="pages/simples/simples.html">
            
                <a href="pages/simples/simples.html">
            
                    
                    7. 配置案例
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="pages/simples/web_auth_config.html">
            
                <a href="pages/simples/web_auth_config.html">
            
                    
                    7.1. WEB认证配置
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="1-&#x5173;&#x4E8E;&#x6211;&#x4EEC;">1. &#x5173;&#x4E8E;&#x6211;&#x4EEC;</h2>
<p>&#x957F;&#x6C99;&#x5E02;&#x540C;&#x8FC5;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x6280;&#x6709;&#x9650;&#x516C;&#x53F8;&#x81F4;&#x529B;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7F51;&#x7EDC;&#x8FD0;&#x8425; &amp; &#x4F18;&#x5316;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EA7;&#x54C1;&#x7684;&#x7814;&#x53D1;&#x9500;&#x552E;&#xFF0C;&#x4E3A; ISP&#x3001;&#x4F01;&#x4E1A;&#x3001;&#x6559;&#x80B2;&#x3001;&#x7F51;&#x5427;&#x7B49;&#x884C;&#x4E1A;&#x9886;&#x57DF;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x4E1A;&#x754C;&#x9886;&#x5148;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x4F9D;&#x6258;&#x4E8E;&#x5F53;&#x524D;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x5185;&#x6700;&#x4E3A;&#x5148;&#x8FDB;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x67B6;&#x6784;&#x3001;&#x6570;&#x636E;&#x5305;&#x5904;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x5F00;&#x53D1;&#x51FA;&#x5F3A;&#x5927;&#x7684; XSPEEDER &#x5F15;&#x64CE;&#x3002;&#x91C7;&#x7528;&#x6DF1;&#x5C42;&#x6570;&#x636E;&#x5305;(DPI)&#x548C;&#x6DF1;&#x5C42;&#x6570;&#x636E;&#x6D41;&#x5904;&#x7406;&#x6280;&#x672F;(DFI)&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x62A5;&#x6587;&#x8FDB;&#x884C;&#x6700;&#x4E3A;&#x7CBE;&#x786E;&#x7684;&#x8BC6;&#x522B;&#x3002;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x8DEF;&#x7531;&#x3001;&#x5E94;&#x7528;&#x5206;&#x6D41;&#x3001;&#x5E94;&#x7528;&#x4F18;&#x5148;&#x3001;DNS&#x7BA1;&#x63A7;&#x3001;&#x5B89;&#x5168;&#x7BA1;&#x7406;&#x7B49;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x5404;&#x7C7B;&#x7F51;&#x7EDC;&#x5C24;&#x5176;&#x662F;&#x590D;&#x6742;&#x7F51;&#x7EDC;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x4E0E;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4FDD;&#x62A4;&#x3002;&#x662F;ISP&#x8FD0;&#x8425;&#x5546;&#x3001;&#x5C0F;&#x533A;&#x3001;&#x4F01;&#x4E1A;&#x3001;&#x9AD8;&#x6821;&#x3001;&#x9152;&#x5E97;&#x7B49;&#x4E0A;&#x7F51;&#x573A;&#x6240;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x9996;&#x9009;&#x7684;&#x8DEF;&#x7531;&#x4EA7;&#x54C1;&#x3002;</p>
<p>XSPEEDER &#x9886;&#x5148;&#x7684;&#x4EA7;&#x54C1;&#x548C;&#x6280;&#x672F;&#xFF0C;&#x6E90;&#x81EA;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x591A;&#x5E74;&#x7684;&#x79EF;&#x7D2F;&#x548C;&#x5E94;&#x7528;&#xFF0C;&#x62E5;&#x6709;&#x591A;&#x9879;&#x8F6F;&#x4EF6;&#x8457;&#x4F5C;&#x6743;&#xFF0C;&#x6211;&#x4EEC;&#x81F4;&#x529B;&#x4E8E;&#x6539;&#x53D8;&#x4E92;&#x8054;&#x7F51;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#x9AD8;&#x3001;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E0D;&#x597D;&#x7684;&#x73B0;&#x72B6;&#xFF0C;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x4E00;&#x8D77;&#xFF0C;&#x4E3A;&#x5BA2;&#x6237;&#x521B;&#x9020;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x505A;&#x51FA;&#x8D21;&#x732E;&#x3002;</p>
<h2 id="2-&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x4ECB;&#x7ECD;">2. &#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x4ECB;&#x7ECD;</h2>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x662F;&#x4E00;&#x6B3E;&#x57FA;&#x4E8E;SDN&#x6784;&#x67B6;&#x800C;&#x5B9E;&#x73B0;&#x7684;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E3B;&#x8981;&#x7531;&#x5E94;&#x7528;&#x7279;&#x5F81;&#x5E93;&#x3001;&#x5E94;&#x7528;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x8DEF;&#x7531;&#x56DB;&#x5927;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x3001;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x3001;&#x7B56;&#x7565;&#x7BA1;&#x7406;&#x3001;&#x76D1;&#x63A7;&#x7EDF;&#x8BA1;&#x3001;&#x9762;&#x677F;&#x7BA1;&#x7406;&#x4E94;&#x5927;&#x4EBA;&#x673A;&#x4E92;&#x52A8;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x5BF9;&#x6D41;&#x7ECF;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x4E0E;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x4ECE;&#x57FA;&#x7840;&#x786C;&#x4EF6;&#x67B6;&#x6784;&#x4E0A;&#xFF0C;&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x5145;&#x5206;&#x8003;&#x8651;&#x5E94;&#x7528;&#x5C42;&#x5904;&#x7406;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E13;&#x4E3A;&#x5904;&#x7406;&#x5E94;&#x7528;&#x5C42;&#x8BC6;&#x522B;&#x4E0E;&#x63A7;&#x5236;&#x8BBE;&#x8BA1;&#x4E86;XspeederOS&#xFF0C;&#x4F7F;&#x7528;Intel x86&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#xFF0C;&#x76F8;&#x6BD4;&#x8D77;&#x540C;&#x7B49;&#x7EA7;&#x7528;ASIC&#x3001;NP&#x786C;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5177;&#x6709;&#x6210;&#x672C;&#x4F4E;&#x3001;&#x6027;&#x80FD;&#x9AD8;&#x3001;&#x5347;&#x7EA7;&#x7075;&#x6D3B;&#x7B49;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x5177;&#x5907;&#x4E13;&#x4E1A;&#x7684;&#x534F;&#x8BAE;&#x7279;&#x5F81;&#x5E93;&#xFF0C;&#x5E76;&#x6709;&#x5148;&#x8FDB;&#x7684;&#x66F4;&#x65B0;&#x7EF4;&#x62A4;&#x673A;&#x5236;&#xFF0C;&#x540C;&#x7EA7;&#x786C;&#x4EF6;&#x7684;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x9AD8;&#xFF0C;&#x5904;&#x4E8E;&#x56FD;&#x5185;&#x9886;&#x5148;&#x6C34;&#x5E73;&#xFF0C;Intel x86&#x53CC;&#x6838;&#x6027;&#x80FD;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x5343;&#x5146;&#x7EBF;&#x901F;&#x3002;&#x4F7F;&#x7528;Intel&#x67B6;&#x6784;&#x786C;&#x4EF6;&#x7CFB;&#x7EDF;&#x548C;Xseepder&#x8F6F;&#x4EF6;&#x5F15;&#x64CE;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E;Intel CPU&#x548C;PCI Express&#x603B;&#x7EBF;&#x6280;&#x672F;&#x53D1;&#x5C55;&#xFF0C;&#x4E3A;&#x53D1;&#x5C55;&#x9AD8;&#x7AEF;&#x4EA7;&#x54C1;&#x5E26;&#x6765;&#x4E86;&#x826F;&#x597D;&#x7684;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#xFF0C;&#x786C;&#x4EF6;&#x4E0D;&#x518D;&#x662F;&#x74F6;&#x9888;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x5E26;&#x6765;&#x66F4;&#x5F3A;&#x7684;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x3002;</p>
<h3 id="21-&#x4EA7;&#x54C1;&#x7279;&#x8272;">2.1 &#x4EA7;&#x54C1;&#x7279;&#x8272;</h3>
<blockquote>
<p>&#x8FD0;&#x8425;&#x4E0E;&#x4F18;&#x5316;&#x7684;&#x5229;&#x5668;&#xFF0C;&#x4E3A;&#x5BA2;&#x6237;&#x5B9E;&#x73B0;&#x53EF;&#x6301;&#x7EED;&#x7684;&#x4EF7;&#x503C;&#x589E;&#x957F;</p>
</blockquote>
<h4 id="&#x7CBE;&#x786E;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;">&#x7CBE;&#x786E;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220140418_1.png" alt=""></p>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x7A81;&#x7834;&#x4F20;&#x7EDF;&#x7684;&#x56DB;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x5BF9;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x66F4;&#x7CBE;&#x51C6;&#xFF0C;&#x66F4;&#x5177;&#x6280;&#x672F;&#x6311;&#x6218;&#x6027;&#x7684;DPI 7&#x5C42;&#x6280;&#x672F;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x534F;&#x8BAE;&#x8BC6;&#x522B;&#x5F15;&#x64CE;&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x8BC6;&#x522B;&#x5404;&#x79CD;&#x660E;&#x6587;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5982;Bittorrent&#xFF0C;eDonkey&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x72EC;&#x6709;&#x7684;&#x201C;&#x52A0;&#x5BC6;&#x534F;&#x8BAE;&#x6DF1;&#x5EA6;&#x8BC6;&#x522B;&#x201D;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x7ECF;&#x8FC7;&#x52A0;&#x5BC6;&#x7684;P2P&#x7B49;&#x534F;&#x8BAE;&#x3002;</p>
<h4 id="&#x9AD8;&#x6548;&#x7684;&#x94FE;&#x8DEF;&#x805A;&#x5408;&#x8D1F;&#x8F7D;&#x6280;&#x672F;">&#x9AD8;&#x6548;&#x7684;&#x94FE;&#x8DEF;&#x805A;&#x5408;&#x8D1F;&#x8F7D;&#x6280;&#x672F;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220140559_2.png" alt=""></p>
<p>&#x57FA;&#x4E8E;&#x5E94;&#x7528;&#x7279;&#x6027;&#x5B9E;&#x73B0;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x6700;&#x9AD8;&#x652F;&#x6301;&#x591A;&#x8FBE;2000&#x6761;WAN&#x7EBF;&#x8DEF;&#xFF0C;&#x57FA;&#x4E8E;&#x5E94;&#x7528;&#x534F;&#x8BAE;&#x7684;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x66F4;&#x6709;&#x6548;&#x7684;&#x5B9E;&#x73B0;&#x94FE;&#x8DEF;&#x8D1F;&#x8F7D;&#xFF0C;&#x4F7F;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x66F4;&#x9AD8;&#x6548;&#x3002;</p>
<h4 id="&#x667A;&#x80FD;-dns-&#x7BA1;&#x63A7;&#x7B56;&#x7565;">&#x667A;&#x80FD; DNS &#x7BA1;&#x63A7;&#x7B56;&#x7565;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220140701_3.png" alt=""></p>
<p>&#x901A;&#x8FC7;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#x63A7;&#x5236;&#x4F7F;&#x7528;&#x6307;&#x5B9A;&#x7684;DNS&#x670D;&#x52A1;&#x5668;&#x53BB;&#x89E3;&#x6790;&#x6307;&#x5B9A;&#x7684;&#x57DF;&#x540D;&#x5730;&#x5740;&#x3002;&#x5B9E;&#x73B0;&#x591A;&#x7EBF;&#x60C5;&#x51B5;&#x4E0B;&#x6709;&#x6548;&#x7684;&#x4F18;&#x5316;&#x7F51;&#x5185;&#x8D44;&#x6E90;&#x51FA;&#x53E3;&#x5206;&#x5E03;&#xFF0C;&#x5408;&#x7406;&#x5229;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x964D;&#x4F4E;&#x8FD0;&#x8425;&#x6210;&#x672C;&#x3002;</p>
<h4 id="&#x591A;&#x6837;&#x5316;&#x63A5;&#x5165;&#x8BA4;&#x8BC1;">&#x591A;&#x6837;&#x5316;&#x63A5;&#x5165;&#x8BA4;&#x8BC1;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220140742_4.png" alt=""></p>
<h4 id="&#x5B9E;&#x65F6;&#x70ED;&#x5907;&#x9AD8;&#x53EF;&#x7528;">&#x5B9E;&#x65F6;&#x70ED;&#x5907;&#x9AD8;&#x53EF;&#x7528;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220141209_5.png" alt=""></p>
<h4 id="pppoe-&#x4EE3;&#x7406;&#x62E8;&#x53F7;&#x529F;&#x80FD;">PPPOE &#x4EE3;&#x7406;&#x62E8;&#x53F7;&#x529F;&#x80FD;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220141320_6.png" alt=""></p>
<p>&#x5F53;&#x8FD0;&#x8425;&#x5546;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x8DEF;&#x7531;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x4E0A;&#x7EA7;&#x8BBE;&#x5907;&#x8BA4;&#x8BC1;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x7528;&#x6237;&#x53EA;&#x8981;&#x8DEF;&#x7531;&#x672C;&#x5730;&#x8BA4;&#x8BC1;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x65F6;&#xFF0C;&#x539F;&#x6709;&#x7684;PPPOE&#x65C1;&#x8DEF;&#x65B9;&#x5F0F;&#x5DF2;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x5E02;&#x573A;&#x591A;&#x5143;&#x5316;&#x9700;&#x6C42;,&#x4F7F;&#x7528;PPPOE&#x65C1;&#x8DEF;&#x65B9;&#x5F0F;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x7B2C;&#x4E00;&#x6B21;&#x62E8;&#x53F7;&#x5230;&#x8FD0;&#x8425;&#x5546;&#x5219;&#x4F1A;&#x65AD;&#x7EBF;&#x4E00;&#x6B21;&#xFF0C;&#x800C;&#x795E;&#x884C;&#x8005;PPPOE&#x4EE3;&#x7406;&#x529F;&#x80FD;&#xFF0C;&#x5B8C;&#x7F8E;&#x89E3;&#x51B3;&#x65AD;&#x7EBF;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="pppoe-&#x4EE3;&#x7406;&#x501F;&#x7EBF;&#x529F;&#x80FD;">PPPOE &#x4EE3;&#x7406;&#x501F;&#x7EBF;&#x529F;&#x80FD;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181220141416_7.png" alt=""></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7F51;&#x7EDC;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;PPPOE&#x4EE3;&#x7406;&#x62E8;&#x53F7;&#x7528;&#x6237;&#x7EC4;&#x5F80;&#x5F80;&#x6709;30%~60%&#x7684;&#x95F2;&#x7F6E;&#x5E26;&#x5BBD;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4F20;&#x7EDF;&#x7684;&#x8DEF;&#x7531;PPPOE&#x4EE3;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x65E0;&#x6CD5;&#x5BF9;&#x8FD9;&#x6570;&#x91CF;&#x53EF;&#x89C2;&#x7684;&#x95F2;&#x7F6E;&#x5E26;&#x5BBD;&#x52A0;&#x4EE5;&#x5229;&#x7528;&#x53D8;&#x73B0;&#x3002; &#x901A;&#x8FC7;&#x7B56;&#x7565;&#x8DEF;&#x7531;&#x7684;PPPOE&#x501F;&#x7EBF;&#x7B56;&#x7565;&#xFF0C;&#x914D;&#x5408;&#x7B56;&#x7565;&#x65F6;&#x95F4;&#x8C03;&#x5EA6;&#xFF0C;&#x53EF;&#x8BA9;&#x672C;&#x5730;&#x62E8;&#x53F7;&#x7528;&#x6237;&#x7EC4;&#x5145;&#x5206;&#x5229;&#x7528;&#x4EE3;&#x7406;&#x62E8;&#x53F7;&#x7528;&#x6237;&#x7EC4;&#x7684;&#x95F2;&#x7F6E;&#x5E26;&#x5BBD;&#xFF0C;&#x7ED9;&#x7F51;&#x7EDC;&#x8FD0;&#x8425;&#x8005;&#x5E26;&#x6765;&#x66F4;&#x9AD8;&#x7684;&#x7ECF;&#x6D4E;&#x4EF7;&#x503C;&#x3002;</p>
<h3 id="22-&#x5E94;&#x7528;&#x573A;&#x666F;">2.2 &#x5E94;&#x7528;&#x573A;&#x666F;</h3>
<h4 id="isp-&#x9AA8;&#x5E72;&#x7F51;&#x4F18;&#x5316;">ISP &#x9AA8;&#x5E72;&#x7F51;&#x4F18;&#x5316;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181221153332_1.png" alt=""></p>
<ul>
<li>&#x90E8;&#x7F72;&#x4E8E;&#x8FD0;&#x8425;&#x5546;&#x9AA8;&#x5E72;&#x7F51;&#x51FA;&#x53E3;&#x4FA7;&#x3002;</li>
<li>&#x6DF1;&#x5EA6;&#x6D41;&#x91CF;&#x5206;&#x6790;&#xFF0C;&#x94FE;&#x8DEF;&#x8D1F;&#x8F7D;&#x758F;&#x5BFC;&#xFF0C;DNS&#x667A;&#x80FD;&#x7BA1;&#x63A7;&#xFF0C;&#x63D0;&#x5347;&#x5E26;&#x5BBD;&#x5229;&#x7528;&#x7387;&#x3002;</li>
<li>&#x6D41;&#x91CF;&#x667A;&#x80FD;&#x8C03;&#x5EA6;&#xFF0C;&#x4FDD;&#x8BC1;&#x5173;&#x952E;&#x5E94;&#x7528;&#x7684;&#x901A;&#x4FE1;&#x8D28;&#x91CF;&#xFF0C;&#x901A;&#x8FC7;&#x7F13;&#x5B58;&#x7F13;&#x89E3;P2P&#x538B;&#x529B;&#x3002;</li>
<li>&#x5B9E;&#x65F6;&#x6D41;&#x91CF;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x65E5;&#x5FD7;&#x751F;&#x6210;&#xFF0C;&#x63D0;&#x4F9B;&#x7EDF;&#x4E00;&#x5B58;&#x50A8;&#x7BA1;&#x7406;&#x4E0E;&#x53EF;&#x89C6;&#x5316;&#x5206;&#x6790;&#x3002;</li>
<li>&#x7CBE;&#x7EC6;&#x5316;&#x5E26;&#x5BBD;&#x7BA1;&#x7406;&#xFF0C;&#x63D0;&#x5347;&#x5F53;&#x524D;&#x94FE;&#x8DEF;&#x7684;&#x7528;&#x6237;&#x627F;&#x8F7D;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x9AD8;&#x6536;&#x76CA;&#x80FD;&#x529B;&#x3002;</li>
</ul>
<h4 id="isp-&#x6574;&#x4F53;&#x8FD0;&#x8425;&#x89E3;&#x51B3;&#x65B9;&#x6848;">ISP &#x6574;&#x4F53;&#x8FD0;&#x8425;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181221153621_2.png" alt=""></p>
<p>&#x91C7;&#x7528;&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x4F5C;&#x4E3A;&#x7EFC;&#x5408;&#x7F51;&#x5173;&#x3001;&#x7ED3;&#x5408;&#x795E;&#x884C;&#x8005;&#x7F13;&#x5B58;&#x3001;&#x795E;&#x884C;&#x8005;IPTV&#xFF0C; &#x795E;&#x884C;&#x8005;&#x65E5;&#x5FD7;&#xFF0C;&#x795E;&#x884C;&#x8005;&#x4E13;&#x7248;&#x8BA1;&#x8D39;&#x6574;&#x4F53;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5B9E;&#x73B0;&#x4ECE;&#x7F51;&#x7EDC;&#x63A5;&#x5165;&#x3001;PPPOE&#x8BA4;&#x8BC1;&#x3001;RADIUS&#x8BA1;&#x8D39;&#x3001;WEB&#x8BA4;&#x8BC1;&#x3001;&#x5E26;&#x5BBD;&#x4F18;&#x5316;&#x3001;IPTV&#x3001;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x7F13;&#x5B58;&#x5230;&#x65E5;&#x5FD7;&#x5BA1;&#x8BA1;&#x7684;&#x6240;&#x6709;&#x9700;&#x6C42;&#x3002;&#x9488;&#x5BF9;&#x4E2D;&#x5C0F;&#x8FD0;&#x8425;&#x5546;&#x884C;&#x4E1A;&#x7279;&#x6027;&#xFF0C;&#x63D0;&#x4F9B;&#x7075;&#x6D3B;&#x7684;&#x4E0D;&#x540C;&#x89C4;&#x683C;&#x7EC4;&#x5408;&#x8FD0;&#x8425;&#x65B9;&#x6848;&#xFF0C;&#x524D;&#x671F;&#x5F00;&#x5C40;&#x540E;&#x671F;&#x6269;&#x5BB9;&#x5747;&#x53EF;&#x8F7B;&#x677E;&#x5E94;&#x5BF9;&#x3002;</p>
<h4 id="&#x653F;&#x5E9C;&#x3001;&#x4F01;&#x4E1A;&#x3001;&#x6821;&#x56ED;&#x3001;&#x9152;&#x5E97;&#x3001;&#x7F51;&#x5427;&#x51FA;&#x53E3;&#x4E00;&#x4F53;&#x5316;">&#x653F;&#x5E9C;&#x3001;&#x4F01;&#x4E1A;&#x3001;&#x6821;&#x56ED;&#x3001;&#x9152;&#x5E97;&#x3001;&#x7F51;&#x5427;&#x51FA;&#x53E3;&#x4E00;&#x4F53;&#x5316;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181221153734_3.png" alt=""></p>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x4F5C;&#x4E3A;&#x7EDF;&#x4E00;&#x7F51;&#x5173;&#x90E8;&#x7F72;&#xFF0C;&#x5B9E;&#x73B0;&#x51FA;&#x53E3;&#x4E00;&#x4F53;&#x5316;&#xFF0C;&#x63D0;&#x4F9B;&#x6D41;&#x63A7;&#xFF0C;&#x94FE;&#x8DEF;&#x8D1F;&#x8F7D;&#xFF0C;&#x4E0A;&#x7F51;&#x884C;&#x4E3A;&#x7BA1;&#x7406;&#xFF0C;&#x5E94;&#x7528;&#x8D1F;&#x8F7D;&#x3001;&#x65E0;&#x7EBF;&#x8BA4;&#x8BC1;&#x3001;PPPOE&#x3001;DHCP&#x3001;DNS&#x3001;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x91C7;&#x96C6;&#x7B49;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x7279;&#x6709;&#x7684;&#x7EBF;&#x8DEF;&#x53E0;&#x52A0;&#x8D1F;&#x8F7D;&#x673A;&#x5236;&#xFF0C;&#x8F7B;&#x677E;&#x89E3;&#x51B3;&#x5E26;&#x5BBD;&#x6269;&#x5BB9;&#x3002;</p>
<h4 id="&#x6D77;&#x91CF;&#x65E5;&#x5FD7;&#x5904;&#x7406;--&#x5927;&#x6570;&#x636E;&#x5E73;&#x53F0;--&#x7F51;&#x7EDC;&#x8D8B;&#x52BF;&#x611F;&#x77E5;">&#x6D77;&#x91CF;&#x65E5;&#x5FD7;&#x5904;&#x7406; / &#x5927;&#x6570;&#x636E;&#x5E73;&#x53F0; / &#x7F51;&#x7EDC;&#x8D8B;&#x52BF;&#x611F;&#x77E5;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181221153846_4.png" alt=""></p>
<p>&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#x5177;&#x5907;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x5185;&#x5148;&#x8FDB;&#x7684;&#x6570;&#x636E;&#x5305;&#x5904;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x80FD;&#x8BC6;&#x522B;95%&#x4EE5;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5B9E;&#x73B0;&#x7CBE;&#x51C6;&#x6D41;&#x91CF;&#x5206;&#x6790;&#xFF0C;&#x751F;&#x6210;&#x8BE6;&#x7EC6;&#x7684;&#x65E5;&#x5FD7;&#x6570;&#x636E;&#x3002;&#x7ED3;&#x5408;&#x795E;&#x884C;&#x8005;&#x65E5;&#x5FD7;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6D77;&#x91CF;PB&#x7EA7;&#x522B;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5206;&#x6790;&#x3002;&#x5E2E;&#x52A9;&#x8FD0;&#x8425;&#x5546;&#x5B9E;&#x73B0;&#x7CBE;&#x7EC6;&#x5316;&#x8FD0;&#x8425;&#xFF0C;&#x4E3A;&#x7B2C;&#x4E09;&#x65B9;&#x63D0;&#x4F9B;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x6E90;&#x3002;&#x534F;&#x52A9;&#x8FD0;&#x8425;&#x5546;&#x9AD8;&#x6548;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#x7F51;&#x7EDC;&#x65E5;&#x5FD7;&#x5E76;&#x4E3A;&#x5B89;&#x5168;&#x4E8B;&#x4EF6;&#x7684;&#x4E8B;&#x540E;&#x53D6;&#x8BC1;&#x63D0;&#x4F9B;&#x4F9D;&#x636E;&#x3002;&#x9002;&#x7528;&#x4E8E;&#x8FD0;&#x8425;&#x5546;&#x3001;&#x7F51;&#x7EDC;&#x76D1;&#x7BA1;&#x76F8;&#x5173;&#x5355;&#x4F4D;&#x3001;&#x5927;&#x6570;&#x636E;&#x5E94;&#x7528;&#x7EC4;&#x7EC7;&#x5B9E;&#x4F53;&#x3002;</p>
<h4 id="&#x5546;&#x4E1A;&#x573A;&#x666F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;">&#x5546;&#x4E1A;&#x573A;&#x666F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;</h4>
<p><img src="http://static.toughcloud.net/toughsms/tc_20181221154010_5.png" alt=""></p>
<p>&#x9488;&#x5BF9;&#x8FD0;&#x8425;&#x5546;&#x3001;&#x4E13;&#x4E1A;&#x5546;&#x4E1A;WIFI&#x8FD0;&#x8425;&#x673A;&#x6784;&#x63D0;&#x4F9B;&#x96C6;&#x4E2D;&#x90E8;&#x7F72;&#x7684;&#x8FD0;&#x8425;&#x7BA1;&#x7406;&#x5E73;&#x53F0;&#xFF0C;&#x6574;&#x5408;&#x795E;&#x884C;&#x8005;&#x8DEF;&#x7531;&#xFF0C;&#x795E;&#x884C;&#x8005;&#x7F13;&#x5B58;&#xFF0C;&#x795E;&#x884C;&#x8005;&#x7EDF;&#x4E00;&#x8BA4;&#x8BC1;&#x95E8;&#x6237;&#x3001;&#x795E;&#x884C;&#x8005;&#x4E13;&#x7248;&#x8BA1;&#x8D39;&#x7CFB;&#x5217;&#x4EA7;&#x54C1;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x6574;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<blockquote>
<p><strong>&#x5B89;&#x5168;&#x65E0;&#x611F;&#x77E5;&#x8BA4;&#x8BC1;</strong>: &#x7528;&#x6237;&#x5728;&#x7B2C; &#x4E00;&#x6B21;&#x8BA4;&#x8BC1;&#x901A;&#x8FC7;&#x540E;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x8BB0;&#x5F55;&#x8BE5;&#x7528;&#x6237;&#x7EC8;&#x7AEF;&#x7684;MAC&#xFF0C;&#x8BE5;&#x7EC8;&#x7AEF;&#x518D;&#x6B21;&#x5165;&#x7F51;&#x65F6;&#x7528;&#x6237;&#x65E0;&#x9700;&#x624B;&#x52A8;&#x8BA4;&#x8BC1;&#x5373;&#x53EF;&#x76F4;&#x63A5;&#x4E0A;&#x7F51;&#x3002;&#x540C;&#x65F6;&#x5229;&#x7528;DHCP option&#x7684;&#x7EC8;&#x7AEF;&#x4FE1;&#x606F;&#x8BC6;&#x522B;&#x4E0E;&#x4F20;&#x7EDF;&#x8BA4;&#x8BC1;&#x8BA1;&#x8D39;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x5408;&#x6709;&#x6548;&#x7BA1;&#x7406;&#x7EC8;&#x7AEF;&#x8BBE;&#x5907;&#xFF0C;&#x901A;&#x8FC7;&#x5927;&#x6570;&#x636E;&#x667A;&#x80FD;&#x5316;&#x5BF9;&#x7EC8;&#x7AEF;MAC&#x548C;&#x7EC8;&#x7AEF;&#x7C7B;&#x578B;&#x5339;&#x914D;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x963B;&#x788D;&#x975E;&#x6CD5;&#x4FEE;&#x6539;MAC&#x5730;&#x5740;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4E0D;&#x4EC5;&#x89E3;&#x51B3;&#x4E86;&#x4F20;&#x7EDF;&#x65E0;&#x611F;&#x77E5;MAC&#x5730;&#x5740;&#x4EFF;&#x5192;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x5347;&#x4E86;&#x8BA4;&#x8BC1;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4E5F;&#x8BA9;&#x57FA;&#x4E8E;&#x7EC8;&#x7AEF;&#x7C7B;&#x578B;&#x7684;&#x5B89;&#x5168;&#x63A7;&#x5236;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="pages/support.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1. 服务支持">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"1. 服务支持","level":"1.2","depth":1,"path":"pages/support.md","ref":"pages/support.md","articles":[]},"dir":"ltr"},"config":{"plugins":["prism","-highlight"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"fontSettings":{"theme":"white","family":"msyh","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"plugins":["yahei","katex","-search"],"prism":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}},"theme":"default","author":"www.xspeeder.com","style":{"website":"styles/website.css","pdf":"styles/pdf.css"},"pdf":{"pageNumbers":true,"fontSize":13,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":20,"left":20,"top":20,"bottom":20},"toc":true},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"神行者路由用户手册","language":"zh","links":{"sidebar":{"PDF文档下载":"https://github.com/xspeeder-software/xspeeder-docs/raw/master/xspeeder-docs.pdf"}},"gitbook":"*","description":"","extension":""},"file":{"path":"README.md","mtime":"2018-12-21T08:04:26.243Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-24T07:30:33.809Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

